; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-3-5-25)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	p0-3 - location
	p2-4 - location
	p2-5 - location
	p2-6 - location
	p3-1 - location
	p4-1 - location
	p5-0 - location
	p6-1 - location
	p6-2 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s5)
	(at driver3 s1)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s0)
	(empty truck2)
	(at truck3 s5)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s6)
	(empty truck5)
	(at package1 s4)
	(at package2 s1)
	(at package3 s0)
	(at package4 s1)
	(at package5 s1)
	(at package6 s0)
	(at package7 s2)
	(at package8 s4)
	(at package9 s2)
	(at package10 s3)
	(at package11 s4)
	(at package12 s5)
	(at package13 s2)
	(at package14 s2)
	(at package15 s3)
	(at package16 s0)
	(at package17 s1)
	(at package18 s6)
	(at package19 s5)
	(at package20 s2)
	(at package21 s5)
	(at package22 s5)
	(at package23 s3)
	(at package24 s5)
	(at package25 s5)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(path s3 p3-1)
	(path p3-1 s3)
	(path s1 p3-1)
	(path p3-1 s1)
	(path s4 p4-1)
	(path p4-1 s4)
	(path s1 p4-1)
	(path p4-1 s1)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s3)
	(link s3 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s1 s5)
	(link s5 s1)
	(link s2 s3)
	(link s3 s2)
	(link s4 s3)
	(link s3 s4)
	(link s4 s6)
	(link s6 s4)
	(link s5 s2)
	(link s2 s5)
	(link s5 s3)
	(link s3 s5)
	(link s5 s4)
	(link s4 s5)
	(link s6 s3)
	(link s3 s6)
)
	(:goal (and
	(at driver3 s3)
	(at truck1 s4)
	(at truck3 s1)
	(at package1 s4)
	(at package2 s3)
	(at package3 s5)
	(at package4 s4)
	(at package5 s5)
	(at package6 s5)
	(at package7 s5)
	(at package8 s4)
	(at package9 s5)
	(at package10 s5)
	(at package11 s2)
	(at package12 s3)
	(at package13 s4)
	(at package14 s6)
	(at package15 s1)
	(at package16 s1)
	(at package17 s4)
	(at package18 s2)
	(at package19 s4)
	(at package20 s0)
	(at package22 s4)
	(at package23 s0)
	(at package24 s2)
	(at package25 s6)
	))


)

; plan
1. (load-truck s0 package6 truck2)
   deleted: (at package6 s0)
   added: (in package6 truck2)
   goals met: 2 of 27
2. (load-truck s0 package3 truck2)
   deleted: (at package3 s0)
   added: (in package3 truck2)
   goals met: 2 of 27
3. (load-truck s0 package16 truck2)
   deleted: (at package16 s0)
   added: (in package16 truck2)
   goals met: 2 of 27
4. (load-truck s6 package18 truck5)
   deleted: (at package18 s6)
   added: (in package18 truck5)
   goals met: 2 of 27
5. (board-truck driver2 s5 truck3)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 2 of 27
6. (unload-truck s0 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   goals met: 2 of 27
7. (unload-truck s0 package3 truck2)
   deleted: (in package3 truck2)
   added: (at package3 s0)
   goals met: 2 of 27
8. (unload-truck s0 package16 truck2)
   deleted: (in package16 truck2)
   added: (at package16 s0)
   goals met: 2 of 27
9. (load-truck s5 package25 truck3)
   deleted: (at package25 s5)
   added: (in package25 truck3)
   goals met: 2 of 27
10. (load-truck s5 package24 truck3)
   deleted: (at package24 s5)
   added: (in package24 truck3)
   goals met: 2 of 27
11. (load-truck s5 package22 truck3)
   deleted: (at package22 s5)
   added: (in package22 truck3)
   goals met: 2 of 27
12. (load-truck s5 package19 truck3)
   deleted: (at package19 s5)
   added: (in package19 truck3)
   goals met: 2 of 27
13. (load-truck s5 package12 truck3)
   deleted: (at package12 s5)
   added: (in package12 truck3)
   goals met: 2 of 27
14. (walk driver3 s1 p3-1)
   deleted: (at driver3 s1)
   added: (at driver3 p3-1)
   goals met: 2 of 27
15. (walk driver1 s1 p6-1)
   deleted: (at driver1 s1)
   added: (at driver1 p6-1)
   goals met: 2 of 27
16. (walk driver1 p6-1 s6)
   deleted: (at driver1 p6-1)
   added: (at driver1 s6)
   goals met: 2 of 27
17. (walk driver3 p3-1 s3)
   deleted: (at driver3 p3-1)
   added: (at driver3 s3)
   goals met: 3 of 27
18. (board-truck driver1 s6 truck5)
   deleted: (at driver1 s6) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 3 of 27
19. (drive-truck driver1 s6 s3 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   goals met: 3 of 27
20. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 3 of 27
21. (load-truck s2 package9 truck5)
   deleted: (at package9 s2)
   added: (in package9 truck5)
   goals met: 3 of 27
22. (load-truck s2 package7 truck5)
   deleted: (at package7 s2)
   added: (in package7 truck5)
   goals met: 3 of 27
23. (load-truck s2 package20 truck5)
   deleted: (at package20 s2)
   added: (in package20 truck5)
   goals met: 3 of 27
24. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 3 of 27
25. (load-truck s3 package23 truck5)
   deleted: (at package23 s3)
   added: (in package23 truck5)
   goals met: 3 of 27
26. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 3 of 27
27. (load-truck s0 package6 truck5)
   deleted: (at package6 s0)
   added: (in package6 truck5)
   goals met: 3 of 27
28. (load-truck s0 package3 truck5)
   deleted: (at package3 s0)
   added: (in package3 truck5)
   goals met: 3 of 27
29. (drive-truck driver1 s0 s5 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s5)
   goals met: 3 of 27
30. (unload-truck s5 package9 truck5)
   deleted: (in package9 truck5)
   added: (at package9 s5)
   goals met: 4 of 27
31. (unload-truck s5 package7 truck5)
   deleted: (in package7 truck5)
   added: (at package7 s5)
   goals met: 5 of 27
32. (drive-truck driver1 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 5 of 27
33. (unload-truck s0 package23 truck5)
   deleted: (in package23 truck5)
   added: (at package23 s0)
   goals met: 6 of 27
34. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 6 of 27
35. (load-truck s1 package5 truck5)
   deleted: (at package5 s1)
   added: (in package5 truck5)
   goals met: 6 of 27
36. (drive-truck driver1 s1 s5 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s5)
   goals met: 6 of 27
37. (unload-truck s5 package6 truck5)
   deleted: (in package6 truck5)
   added: (at package6 s5)
   goals met: 7 of 27
38. (drive-truck driver1 s5 s3 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s3)
   goals met: 7 of 27
39. (load-truck s3 package15 truck5)
   deleted: (at package15 s3)
   added: (in package15 truck5)
   goals met: 7 of 27
40. (drive-truck driver1 s3 s0 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s0)
   goals met: 7 of 27
41. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 7 of 27
42. (load-truck s1 package4 truck5)
   deleted: (at package4 s1)
   added: (in package4 truck5)
   goals met: 7 of 27
43. (drive-truck driver1 s1 s5 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s5)
   goals met: 7 of 27
44. (unload-truck s5 package5 truck5)
   deleted: (in package5 truck5)
   added: (at package5 s5)
   goals met: 8 of 27
45. (unload-truck s5 package3 truck5)
   deleted: (in package3 truck5)
   added: (at package3 s5)
   goals met: 9 of 27
46. (drive-truck driver1 s5 s0 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s0)
   goals met: 9 of 27
47. (unload-truck s0 package20 truck5)
   deleted: (in package20 truck5)
   added: (at package20 s0)
   goals met: 10 of 27
48. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 10 of 27
49. (load-truck s1 package2 truck5)
   deleted: (at package2 s1)
   added: (in package2 truck5)
   goals met: 10 of 27
50. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 10 of 27
51. (drive-truck driver1 s0 s3 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s3)
   goals met: 10 of 27
52. (unload-truck s3 package2 truck5)
   deleted: (in package2 truck5)
   added: (at package2 s3)
   goals met: 11 of 27
53. (load-truck s3 package10 truck5)
   deleted: (at package10 s3)
   added: (in package10 truck5)
   goals met: 11 of 27
54. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 11 of 27
55. (unload-truck s2 package18 truck5)
   deleted: (in package18 truck5)
   added: (at package18 s2)
   goals met: 12 of 27
56. (drive-truck driver1 s2 s5 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s5)
   goals met: 12 of 27
57. (drive-truck driver1 s5 s4 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s4)
   goals met: 12 of 27
58. (unload-truck s4 package4 truck5)
   deleted: (in package4 truck5)
   added: (at package4 s4)
   goals met: 13 of 27
59. (load-truck s4 package11 truck5)
   deleted: (at package11 s4)
   added: (in package11 truck5)
   goals met: 13 of 27
60. (drive-truck driver1 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 13 of 27
61. (drive-truck driver1 s5 s2 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s2)
   goals met: 13 of 27
62. (load-truck s2 package14 truck5)
   deleted: (at package14 s2)
   added: (in package14 truck5)
   goals met: 13 of 27
63. (load-truck s2 package13 truck5)
   deleted: (at package13 s2)
   added: (in package13 truck5)
   goals met: 13 of 27
64. (drive-truck driver1 s2 s3 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s3)
   goals met: 13 of 27
65. (drive-truck driver1 s3 s4 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s4)
   goals met: 13 of 27
66. (unload-truck s4 package13 truck5)
   deleted: (in package13 truck5)
   added: (at package13 s4)
   goals met: 14 of 27
67. (drive-truck driver1 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 14 of 27
68. (unload-truck s5 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s5)
   goals met: 15 of 27
69. (drive-truck driver1 s5 s1 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   goals met: 15 of 27
70. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 15 of 27
71. (load-truck s0 package16 truck5)
   deleted: (at package16 s0)
   added: (in package16 truck5)
   goals met: 15 of 27
72. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 15 of 27
73. (load-truck s1 package17 truck5)
   deleted: (at package17 s1)
   added: (in package17 truck5)
   goals met: 15 of 27
74. (unload-truck s1 package16 truck5)
   deleted: (in package16 truck5)
   added: (at package16 s1)
   goals met: 16 of 27
75. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 16 of 27
76. (drive-truck driver1 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 16 of 27
77. (unload-truck s6 package14 truck5)
   deleted: (in package14 truck5)
   added: (at package14 s6)
   goals met: 17 of 27
78. (drive-truck driver2 s5 s3 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   goals met: 17 of 27
79. (unload-truck s3 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s3)
   goals met: 18 of 27
80. (drive-truck driver2 s3 s4 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s4)
   goals met: 18 of 27
81. (unload-truck s4 package22 truck3)
   deleted: (in package22 truck3)
   added: (at package22 s4)
   goals met: 19 of 27
82. (unload-truck s4 package19 truck3)
   deleted: (in package19 truck3)
   added: (at package19 s4)
   goals met: 20 of 27
83. (drive-truck driver2 s4 s5 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s5)
   goals met: 20 of 27
84. (drive-truck driver1 s6 s4 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s4)
   goals met: 20 of 27
85. (unload-truck s4 package17 truck5)
   deleted: (in package17 truck5)
   added: (at package17 s4)
   goals met: 21 of 27
86. (drive-truck driver1 s4 s5 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s5)
   goals met: 21 of 27
87. (drive-truck driver1 s5 s1 truck5)
   deleted: (at truck5 s5)
   added: (at truck5 s1)
   goals met: 21 of 27
88. (unload-truck s1 package15 truck5)
   deleted: (in package15 truck5)
   added: (at package15 s1)
   goals met: 22 of 27
89. (drive-truck driver1 s1 s0 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s0)
   goals met: 22 of 27
90. (drive-truck driver1 s0 s6 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s6)
   goals met: 22 of 27
91. (drive-truck driver2 s5 s2 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s2)
   goals met: 22 of 27
92. (unload-truck s2 package24 truck3)
   deleted: (in package24 truck3)
   added: (at package24 s2)
   goals met: 23 of 27
93. (drive-truck driver2 s2 s3 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s3)
   goals met: 23 of 27
94. (drive-truck driver2 s3 s6 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   goals met: 23 of 27
95. (drive-truck driver1 s6 s3 truck5)
   deleted: (at truck5 s6)
   added: (at truck5 s3)
   goals met: 23 of 27
96. (drive-truck driver1 s3 s2 truck5)
   deleted: (at truck5 s3)
   added: (at truck5 s2)
   goals met: 23 of 27
97. (unload-truck s2 package11 truck5)
   deleted: (in package11 truck5)
   added: (at package11 s2)
   goals met: 24 of 27
98. (unload-truck s6 package25 truck3)
   deleted: (in package25 truck3)
   added: (at package25 s6)
   goals met: 25 of 27
99. (drive-truck driver2 s6 s0 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s0)
   goals met: 25 of 27
100. (drive-truck driver2 s0 s1 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s1)
   goals met: 26 of 27
101. (disembark-truck driver1 s2 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 26 of 27
102. (walk driver1 s2 p2-6)
   deleted: (at driver1 s2)
   added: (at driver1 p2-6)
   goals met: 26 of 27
103. (walk driver1 p2-6 s6)
   deleted: (at driver1 p2-6)
   added: (at driver1 s6)
   goals met: 26 of 27
104. (board-truck driver1 s6 truck1)
   deleted: (at driver1 s6) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 26 of 27
105. (drive-truck driver1 s6 s4 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s4)
   goals met: 27 of 27
